/*
Факториал
Факториалом натурального числа NN называют произведение всех натуральных чисел от 11 до NN включительно. Факториал обозначают значком !! после числа.
Например:
3!=1⋅2⋅33!=1⋅2⋅3 -- факториал трёх
5!=1⋅2⋅3⋅4⋅55!=1⋅2⋅3⋅4⋅5 -- факториал пяти

Напишите программу, которая вычисляет значение факториала для первых 10 чисел.

Входные данные:
отсутствуют

Выходные данные:
10 строк вида. Поле под значение факториала −− 8 символов.

1! =       1
2! =       2
3! =       6



Sample Input:


Sample Output:

1! =       1
2! =       2
3! =       6
4! =      24
5! =     120
6! =     720
7! =    5040
8! =   40320
9! =  362880
10!= 3628800



*/

#include <stdio.h>

int task_5_1_11(void) {
	int a1, a2, a3, a4, a5, a6, a7, a8, a9, a10;

	a1 = 1;
	a2 = a1 * 2;
	a3 = a2 * 3;
	a4 = a3 * 4;
	a5 = a4 * 5;
	a6 = a5 * 6;
	a7 = a6 * 7;
	a8 = a7 * 8;
	a9 = a8 * 9;
	a10 = a9 * 10;

	printf("1! =%8d\n",a1);
	printf("2! =%8d\n", a2);
	printf("3! =%8d\n", a3);
	printf("4! =%8d\n", a4);
	printf("5! =%8d\n", a5);
	printf("6! =%8d\n", a6);
	printf("7! =%8d\n", a7);
	printf("8! =%8d\n", a8);
	printf("9! =%8d\n", a9);
	printf("10!=%8d\n", a10);


	return 0;
}